# Tokens
TOKEN_DEC = "0123656789"
TOKEN_HEX = "ABCDEF"
TOKEN_ALF_MAI = "GHIJKLMNOPQRSTUVWXYZ"
TOKEN_ALF_MIN = "abcdefghijklmnopqrstuvwxyz"

# Contadores
TK_NUMERO = 0
TK_MOEDA = 0
TK_CADEIA = 0
TK_MENOR_IGUAL = 0
TK_MENOR = 0
TK_ID = 0
TK_COMMENT_BLK = 0
TK_COMMENT_LN = 0
TK_DLMT_ABRE = 0
TK_DLMT_FECHA = 0
TK_DLMT_VIRG = 0
TK_PROGRAMA = 0
TK_FIM_PROGRAMA = 0
TK_SE = 0
TK_SENAO = 0
TK_ENTAO = 0
TK_IMPRIMA = 0
TK_LEIA = 0
TK_ENQUANTO = 0
TK_DIFERENTE = 0
TK_IGUAL = 0
TK_MAIOR_IGUAL = 0
TK_MAIOR = 0
TK_ATRIBUIÇÃO = 0
TK_NEGAÇÃO = 0
TK_ADIÇÃO = 0
TK_SUBTRAÇÃO = 0
TK_MULTIPLICAÇÃO = 0
TK_DIVISÃO = 0
TK_CONJUNÇÃO = 0
TK_DISJUNÇÃO = 0
TK_TOTAL = 0


# Arquivo
arquivo = "ex1.cic"

def PrintSomatorio():
    return ('''
+------------------------------+----------+
|{0:^30}|{33:^10}|
+------------------------------+----------+
|{1:^30}|{34:^10}|
+------------------------------+----------+
|{2:^30}|{35:^10}|
+------------------------------+----------+
|{3:^30}|{36:^10}|
+------------------------------+----------+
|{4:^30}|{37:^10}|
+------------------------------+----------+
|{5:^30}|{38:^10}|
+------------------------------+----------+
|{6:^30}|{39:^10}|
+------------------------------+----------+
|{7:^30}|{40:^10}|
+------------------------------+----------+
|{8:^30}|{41:^10}|
+------------------------------+----------+
|{9:^30}|{42:^10}|
+------------------------------+----------+
|{10:^30}|{43:^10}|
+------------------------------+----------+
|{11:^30}|{44:^10}|
+------------------------------+----------+
|{12:^30}|{45:^10}|
+------------------------------+----------+
|{13:^30}|{46:^10}|
+------------------------------+----------+
|{14:^30}|{47:^10}|
+------------------------------+----------+
|{15:^30}|{48:^10}|
+------------------------------+----------+
|{16:^30}|{49:^10}|
+------------------------------+----------+
|{17:^30}|{50:^10}|
+------------------------------+----------+
|{18:^30}|{51:^10}|
+------------------------------+----------+
|{19:^30}|{52:^10}|
+------------------------------+----------+
|{20:^30}|{53:^10}|
+------------------------------+----------+
|{21:^30}|{54:^10}|
+------------------------------+----------+
|{22:^30}|{55:^10}|
+------------------------------+----------+
|{23:^30}|{56:^10}|
+------------------------------+----------+
|{24:^30}|{57:^10}|
+------------------------------+----------+
|{25:^30}|{58:^10}|
+------------------------------+----------+
|{26:^30}|{59:^10}|
+------------------------------+----------+
|{27:^30}|{60:^10}|
+------------------------------+----------+
|{28:^30}|{61:^10}|
+------------------------------+----------+
|{29:^30}|{62:^10}|
+------------------------------+----------+
|{30:^30}|{63:^10}|
+------------------------------+----------+
|{31:^30}|{64:^10}|
+------------------------------+----------+
|{32:^30}|{65:^10}|
+------------------------------+----------+
'''.format("TOKEN",
"TK_NUMERO",
"TK_MOEDA",
"TK_CADEIA",
"TK_MENOR_IGUAL",
"TK_MENOR",
"TK_ID",
"TK_COMMENT_BLK",
"TK_COMMENT_LN",
"TK_DLMT_ABRE",
"TK_DLMT_FECHA",
"TK_DLMT_VIRG",
"TK_PROGRAMA",
"TK_FIM_PROGRAMA",
"TK_SE",
"TK_SENAO",
"TK_ENTAO",
"TK_IMPRIMA",
"TK_LEIA",
"TK_ENQUANTO",
"TK_DIFERENTE",
"TK_IGUAL",
"TK_MAIOR_IGUAL",
"TK_MAIOR",
"TK_ATRIBUIÇÃO",
"TK_NEGAÇÃO",
"TK_ADIÇÃO",
"TK_SUBTRAÇÃO",
"TK_MULTIPLICAÇÃO",
"TK_DIVISÃO",
"TK_CONJUNÇÃO",
"TK_DISJUNÇÃO",
"TOTAL DE TOKENS",
"QTD_USO",
TK_NUMERO,
TK_MOEDA,
TK_CADEIA,
TK_MENOR_IGUAL,
TK_MENOR,
TK_ID,
TK_COMMENT_BLK,
TK_COMMENT_LN,
TK_DLMT_ABRE,
TK_DLMT_FECHA,
TK_DLMT_VIRG,
TK_PROGRAMA,
TK_FIM_PROGRAMA,
TK_SE,
TK_SENAO,
TK_ENTAO,
TK_IMPRIMA,
TK_LEIA,
TK_ENQUANTO,
TK_DIFERENTE,
TK_IGUAL,
TK_MAIOR_IGUAL,
TK_MAIOR,
TK_ATRIBUIÇÃO,
TK_NEGAÇÃO,
TK_ADIÇÃO,
TK_SUBTRAÇÃO,
TK_MULTIPLICAÇÃO,
TK_DIVISÃO,
TK_CONJUNÇÃO,
TK_DISJUNÇÃO,
TK_TOTAL))